Repository: Tarrellka/Stage1_projects
Catalog: aimeditationguide/lib/l10n/app_*.arb
Languages: ru

source: Hello,
ru: Привет,

# howAreYouFeeling
source: How are you feeling today?
ru: Как ты себя чувствуешь сегодня?

source: Generate Meditation
ru: Создать медитацию

source: Breathing Exercise
ru: Дыхательная практика

source: DAILY ROUTINE
ru: ДНЕВНОЙ ПЛАН

source: Recommended Sessions
ru: Рекомендуемые сессии

source: Continue Last Session
ru: Продолжить прошлую сессию

# continueWith
source: Continue with {duration} session
ru: Продолжить сессию {duration}

source: BACKGROUND SOUNDS
ru: ФОНОВЫЕ ЗВУКИ

source: Background Volume
ru: Громкость фона

source: Prepare
ru: Приготовьтесь

source: Inhale
ru: Вдох

source: Hold
ru: Задержка

source: Exhale
ru: Выдох

# dailyRoutineTitle
source: Your Daily Routine
ru: Твоя рутина на сегодня

# generateRoutineBtn
source: GENERATE NEW ROUTINE
ru: СОЗДАТЬ НОВЫЙ ПЛАН

# exerciseDone
source: Done
ru: Готово

# exerciseLocked
source: Locked
ru: Закрыто

# startExercise
source: Start
ru: Начать

# allDoneTitle
source: Excellent work!
ru: Отличная работа!

# allDoneSubtitle
source: You have completed your daily plan.
ru: Ты выполнил весь план на сегодня.

source: Added to history
ru: Добавлено в историю

source: Error
ru: Ошибка

# loadingMeditation
source: Creating your session...
ru: Создаем вашу сессию...

# goal_relax
source: Relaxation
ru: Расслабление

# goal_focus
source: Focus
ru: Концентрация

# goal_sleep
source: Deep Sleep
ru: Глубокий сон

# voice_male
source: Male
ru: Мужской

# voice_female
source: Female
ru: Женский

# historyTitle
source: History
ru: История

# historyEmpty
source: No meditations yet
ru: Истории пока нет

# historyEmptySub
source: Your completed sessions will appear here
ru: Здесь появятся ваши завершенные сессии

# deleteConfirm
source: Delete this record?
ru: Удалить эту запись?

source: Clear All
ru: Очистить всё

source: Cancel
ru: Отмена

source: Delete
ru: Удалить

# sound_none
source: None
ru: Нет

# sound_nature
source: Nature
ru: Природа

# sound_ambient
source: Ambient music
ru: Эмбиент

# sound_rain
source: Rain
ru: Дождь

source: CALM BREATH
ru: СПОКОЙНОЕ ДЫХАНИЕ

source: FOCUS BREATH
ru: ДЫХАНИЕ ФОКУС

source: RELAX BREATH
ru: РАССЛАБЛЯЮЩЕЕ ДЫХАНИЕ

source: CALM MEDITATION
ru: МЕДИТАЦИЯ ПОКОЯ

source: FOCUS MEDITATION
ru: МЕДИТАЦИЯ ФОКУС

source: RELAX MEDITATION
ru: РЕЛАКС МЕДИТАЦИЯ

# unit_min
source: MIN
ru: МИН

# breathingAction
source: Breathing...
ru: Дышим...

source: Mood Check-in
ru: Как вы сейчас?

source: Duration
ru: Длительность

source: Start Session
ru: Начать практику

# howAreYouFeelingShort
source: How are you feeling?
ru: Как вы себя чувствуете?

source: CONGRATS
ru: ОТЛИЧНО!

source: ROUTINE
ru: ПЛАН

# routineWelcomeMessage
source: Your plan for today is ready. Press START SESSION to begin the practices.
ru: Ваш план на сегодня готов. Нажмите НАЧАТЬ, чтобы приступить к выполнению практик.

source: Morning Practice
ru: Утренняя практика

source: Afternoon Practice
ru: Дневная практика

source: Evening Practice
ru: Вечерняя практика

source: ALL COMPLETED
ru: ВСЁ ВЫПОЛНЕНО

source: START NEXT
ru: СЛЕДУЮЩАЯ

source: CLOSE
ru: ЗАКРЫТЬ

# generatorFillDetails
source: Fill in the details below to generate a meditation
ru: Укажите детали ниже, чтобы создать медитацию

source: Meditation Goal
ru: Цель медитации

# goalStress
source: Reduce stress
ru: Снять стресс

# goalSleep
source: Improve sleep
ru: Улучшить сон

# goalFocus
source: Increase focus
ru: Концентрация

# goalEnergy
source: Boost energy
ru: Заряд энергии

# goalAnxiety
source: Calm anxiety
ru: Снять тревогу

source: Voice Style
ru: Стиль голоса

# voiceSoft
source: Soft
ru: Мягкий

# voiceNeutral
source: Neutral
ru: Нейтральный

# voiceDeep
source: Deep
ru: Глубокий

source: Background Sound
ru: Фоновый звук

# soundNature
source: Nature
ru: Природа

# soundAmbient
source: Ambient music
ru: Амбиент

# soundRain
source: Rain
ru: Дождь

# soundNone
source: None
ru: Без звука

source: Generate
ru: Создать

source: Generating...
ru: Создание...

# aiPreparing
source: AI is preparing your session
ru: ИИ готовит вашу сессию

# personalizedReady
source: Your personalized meditation is ready
ru: Ваша персональная медитация готова

source: Ready
ru: Готово

source: Start
ru: Начать

source: Meditation
ru: Медитация

source: History
ru: История

source: Meditations
ru: Медитации

source: Breathing
ru: Дыхание

# meditationHistoryEmpty
source: Meditation history is empty
ru: История медитаций пуста

# breathingHistoryEmpty
source: Breathing history is empty
ru: История дыхания пуста

source: Completed
ru: Завершено

source: Home
ru: Главная

# onboardingTitle1
source: Relax & Focus
ru: Расслабься и фокуссируйся

# onboardingSubtitle1
source: with AI Meditation
ru: с ИИ Медитацией

# onboardingTitle2
source: AI Creates
ru: ИИ создает

# onboardingSubtitle2
source: Sessions for Your Mood
ru: сессии под твое настроение

# onboardingTitle3
source: Listen & Follow
ru: Слушай и следуй

# onboardingSubtitle3
source: AI Guidance
ru: советам ИИ

# onboardingTitle4
source: Track Your
ru: Отслеживай

# onboardingSubtitle4
source: Mindfulness & Progress
ru: осознанность и прогресс

source: Next
ru: Далее

source: Start Now
ru: Начать сейчас

# backgroundSoundsLabel
source: Background sounds
ru: Фоновые звуки

# backgroundSoundsHeader
source: Background Sounds
ru: Фоновые звуки

# backgroundVolumeTitle
source: Background Volume
ru: Громкость фона

# sessionTitle
source: Your {goal} Session
ru: Сессия: {goal}

# sessionDescription
source: Custom {voice} voice meditation with {sound} atmosphere.
ru: Медитация ({voice}) с атмосферой {sound}.

# breathingLabel
source: Breathing
ru: Дыхание

source: Square Breathing
ru: Квадратное дыхание

source: Deep Relax
ru: Глубокий релакс

# minutesDuration
source: {count} min
ru: {count} мин

source: Box Breathing
ru: Коробочное дыхание
