Repository: Tarrellka/Stage1_projects
Catalog: qrcodescanner/lib/l10n/app_*.arb
Languages: ru

# appTitle
source: AI QR Scanner
ru: AI QR Сканер

# scannerTab
source: Scanner
ru: Сканер

# generatorTab
source: Create
ru: Создать

# historyTab
source: History
ru: История

# scannerTitle
source: Scan QR Code
ru: Сканировать QR-код

# scanInstruction
source: Point your camera at a QR code
ru: Наведите камеру на QR-код

# scanStatusInitial
source: Point the camera at a QR code
ru: Наведите камеру на QR-код

# aiAnalysisTitle
source: AI Analysis
ru: AI Анализ

# aiSecurityAnalysisTitle
source: AI Security Analysis:
ru: AI Анализ безопасности:

# aiAnalyzingProgress
source: Analyzing content...
ru: Анализируем содержимое...

source: Analyzing safety...
ru: Анализирую безопасность...

# copyDataMessage
source: QR Data copied
ru: Данные QR скопированы

# copyAnalysisMessage
source: Analysis copied
ru: Анализ скопирован

# scanAgainButton
source: Scan again
ru: Сканировать еще

# resultScreenTitle
source: Scan Result
ru: Результат сканирования

# codeContentLabel
source: Code content:
ru: Содержимое кода:

# copyButton
source: Copy
ru: Копировать

# openButton
source: Open
ru: Открыть

# historyScreenTitle
source: Scan History
ru: История сканирований

# historyEmpty
source: History is empty
ru: История пуста

# deleteConfirmTitle
source: Clear history?
ru: Очистить историю?

# deleteConfirmContent
source: This action cannot be undone.
ru: Это действие нельзя будет отменить.

# cancelButton
source: Cancel
ru: Отмена

# deleteButton
source: Delete
ru: Удалить

source: No data
ru: Нет данных

source: No analysis
ru: Анализ отсутствует

# qrDataLabel
source: QR Data:
ru: Данные QR:

# aiVerdictLabel
source: AI Verdict:
ru: Вердикт ИИ:

# closeButton
source: Close
ru: Закрыть

# generatorTitle
source: Create QR
ru: Создать QR

# generatorInputLabel
source: Enter text or link
ru: Введите текст или ссылку

# generatorPlaceholder
source: Enter data to generate
ru: Введите данные для генерации

source: Save to gallery
ru: Сохранить в галерею

# saveSuccess
source: QR code saved to gallery!
ru: QR-код сохранен в галерею!

# saveError
source: Error while saving
ru: Ошибка при сохранении

source: Premium feature
ru: Премиум функция

source: Reading image...
ru: Читаю изображение...

# noQrFound
source: No QR code found in photo
ru: QR-код не найден на фото

source: Error reading file
ru: Ошибка при чтении файла

# errorNetwork
source: Network or API error. Check your internet.
ru: Ошибка сети или API. Проверьте интернет.

# errorAnalysis
source: Analysis failed. Please try again.
ru: Ошибка анализа. Попробуйте еще раз.

# premiumTitle
source: Get Premium Access
ru: Получите Premium доступ

# premiumDescription
source: Scan unlimited QR codes, use AI analysis, and remove all ads.
ru: Безлимитное сканирование, AI анализ и никакой рекламы.

# restoreButton
source: Restore
ru: Восстановить

# proAccess
source: Access all pro features
ru: Доступ ко всем PRO функциям

# termsAndPrivacy
source: By continuing, you agree to our Terms of Service and Privacy Policy.
ru: Продолжая, вы соглашаетесь с условиями использования и политикой конфиденциальности.

source: Loading products...
ru: Загрузка продуктов...

# codeDetected
source: Code detected: {code}
ru: Код обнаружен: {code}

# premium_description
source: Unlimited scans, AI analysis, and no ads.
ru: Безлимитные сканы, ИИ-анализ и отсутствие рекламы.

# no_products
source: No available products. Check Apphud dashboard settings.
ru: Нет доступных продуктов. Проверьте настройки в панели Apphud.

source: Upgrade
ru: Улучшить

source: Restore Purchases
ru: Восстановить покупки

# aiSystemPrompt
source: You are a cybersecurity expert. Analyze the QR code data and respond strictly following this plan: 1. Content: [copy the raw data here]. 2. Research: [briefly explain what this link or text is for based on your knowledge]. 3. Recommendation: [state clearly if the user should proceed/open it or not and why]. Provide the answer in English.
ru: Ты эксперт по кибербезопасности. Проанализируй данные QR-кода и ответь строго по плану: 1. Содержимое: [просто скопируй текст из QR]. 2. Исследование: [кратко опиши, куда ведет эта ссылка или для чего нужен этот текст]. 3. Рекомендация: [напиши, стоит ли переходить/открывать это и почему]. Ответ давай на русском языке.
